In [4]:
import numpy as np
import pandas as pd

df = pd.read_csv("c:\\Users\\faisal\\Downloads\\DT task\\day 6\\day06_user_data.csv")

df.replace(["N/A", "?", "unknown", ""], np.nan, inplace=True)

df["age"] = pd.to_numeric(df["age"])
df["income"] = pd.to_numeric(df["income"])

df["age"] = df["age"].fillna(df["age"].mean())
df["income"] = df["income"].fillna(df["income"].mean())
df["city"] = df["city"].fillna(df["city"].mode()[0])

df

     age   income city  churned
0  25.00  50000.0   NY        0
1  31.75  60000.0   SF        1
2  40.00  65500.0   LA        0
3  33.00  65500.0   NY        1
4  31.75  80000.0   NY        0
5  29.00  72000.0   SF        0